      ******************************************************************
      * SDP DESCRIPTION
      *   No realiza ninguna llamada
      * SDP END
      ******************************************************************

      IDENTIFICATION DIVISION.
       PROGRAM-ID.    IVP20000.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       
       WORKING-STORAGE SECTION.
       01  IVP20001   PIC X(08) VALUE 'IVP20000'.
       
       PROCEDURE DIVISION.
       INICIO.
           GOBACK.