      ******************************************************************
      * SDP DESCRIPTION
      *   Comentario multilineaa
      * SDP END
      ******************************************************************
      
      IDENTIFICATION DIVISION.
       PROGRAM-ID.    IVP50006.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       
       WORKING-STORAGE	SECTION.
       01  DATOS.
           03 LITERAL PIC X(80) VALUE 'XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      -                               'YYYYYYYYYYYYYYYYYYY'.     

       PROCEDURE DIVISION.
       INICIO.
           DISPLAY 'MODULO ' IVP50006.
           STOP RUN.