      ******************************************************************
      * SDP DESCRIPTION
      *   Rutina simple
      * SDP END
      ******************************************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID.    IVP50001.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       
       PROCEDURE DIVISION.
       INICIO.
      / Comentario malo
           DISPLAY 'MODULO ' IVP50001.
           GOBACK.