      ******************************************************************
      * SDP DESCRIPTION
      *   Tabulacion entre palabras
      * SDP END
      ******************************************************************
      
      IDENTIFICATION DIVISION.
       PROGRAM-ID.    IVP50004.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       
       WORKING-STORAGE	SECTION.


       PROCEDURE DIVISION.
       INICIO.
           DISPLAY 'MODULO ' IVP50004.
           STOP RUN.