      *> SDP DESC Grafo con GOBACK
      *> SDP IVP 0 SDPAnalyzer.getRC = 0 - Grafo GOBACK

       IDENTIFICATION DIVISION.
       PROGRAM-ID. GRF00002.
       AUTHOR. USRIVP0 - IVP
       DATE-COMPILED. 01/01/2001


       PROCEDURE DIVISION.
           DISPLAY 'Hello World'.
           GOBACK.
 
 