      *> SDP DESC Grafos
      *> SDP IVP 0 SDPAnalyzer.getRC = 0 - Grafo Parrafo inicio y GOBACK

       IDENTIFICATION DIVISION.
       PROGRAM-ID. GRF00004.
       AUTHOR. USRIVP0 - IVP
       DATE-COMPILED. 01/01/2001


       PROCEDURE DIVISION.
       000-INICIO.
           DISPLAY 'Hello World'.
           GOBACK.

 
   