      *> SDP DESC Grafo vacio
      *> SDP IVP 0 SDPAnalyzer.getRC = 0 - Grafo vacio

       IDENTIFICATION DIVISION.
       PROGRAM-ID. GRF00001.
       AUTHOR. USRIVP0 - IVP
       DATE-COMPILED. 01/01/2001


       PROCEDURE DIVISION.
           DISPLAY 'Hello World'.

