      *> SDP DESC Grafos
      *> SDP IVP 0 Graph.NumGraphs = 1 - Grafo Parrafo inicio
      *> SDP IVP 0 Graph.NumNodes  = 3 

       IDENTIFICATION DIVISION.
       PROGRAM-ID. GRF00003.
       AUTHOR. USRIVP0 - IVP
       DATE-COMPILED. 01/01/2001


       PROCEDURE DIVISION.
       000-INICIO.
           DISPLAY 'Hello World'.

 
  