      *> SDP DESC Grafo con GOBACK
      *> SDP IVP 0 Graph.NumGraphs = 1 - Grafo simple
      *> SDP IVP 0 Graph.NumNodes  = 3 - Grafo ssimple

       IDENTIFICATION DIVISION.
       PROGRAM-ID. GRF00002.
       AUTHOR. USRIVP0 - IVP
       DATE-COMPILED. 01/01/2001


       PROCEDURE DIVISION.
           DISPLAY 'Hello World'.
           GOBACK.
 
 