      *> SDP DESC Programa sin parrafos
      *> SDP IVP 0 RC = 0 - Caso simple RC 0

       IDENTIFICATION DIVISION.
       PROGRAM-ID. IVP00000.
       AUTHOR. USRIVP0 - IVP
       DATE-COMPILED. 01/01/2001


       PROCEDURE DIVISION.
           DISPLAY 'Hello World'.
           GOBACK.
