      ****************************************************************
      * COPY CON NOMBRES DE RUTINAS
      ****************************************************************
       01  SDPCMODS-RUTINAS.
           03 RUTINA1 PIC X(08) VALUE "RUTINA1".
           03 RUTINA2 PIC X(08) VALUE "RUTINA2".
           03 RUTINA3 PIC X(08) VALUE "RUTINA3".
