      ****************************************************************
      * Area de datos a ordenar
      ****************************************************************
          

           03 ITEMS  PIC 9(05) VALUE ZEROS.
           03 TBORDEN.
              05 ORDEN OCCURS 10000 TIMES PIC 9(05).
           03 RC PIC 9(03).   
      


