      * SDP DESCRIPTION
      *  DOC - Programas sinteticos para usar en la documentacion
      * SDP END

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DOCB0202.


       PROCEDURE DIVISION.
           PERFORM INICIO.
           GOBACK.
       INICIO.
           DISPLAY 'Hello World'.
