      * SDP DESCRIPTION
      *  DOC - Programas sinteticos para usar en la documentacion
      * SDP END

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DOCB0101.


       PROCEDURE DIVISION.
           DISPLAY 'Hello World'.
