      * SDP DESCRIPTION
      *  DOC - Programas sinteticos para usar en la documentacion
      * SDP END

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DOCB0102.


       PROCEDURE DIVISION.
       INICIO.
           DISPLAY 'Hello World'.
