      * SDP DESCRIPTION
      *  IVP - Program Hello World
      *  No tiene parrafos
      * SDP END

       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST.


       PROCEDURE DIVISION.
           DISPLAY 'Hello World'.
           GOBACK.