      * SDP DESCRIPTION
      *  IVP - Program Hello World
      *  Un unico parrafo Y end-program
      * SDP END

       IDENTIFICATION DIVISION.
       PROGRAM-ID. IVP00003.


       PROCEDURE DIVISION.
       INICIO.
           DISPLAY 'Hello World'.

       END PROGRAM IVP00003.
