      * SDP DESCRIPTION
      *  IVP - Program Hello World
      *  Un unico parrafo 
      * SDP END

       IDENTIFICATION DIVISION.
       PROGRAM-ID. IVP00002.


       PROCEDURE DIVISION.
       INICIO.
           DISPLAY 'Hello World'.
