      ******************************************************************
      * Author: Javier Gonzalez
      * Date:
      * Purpose: Insercion de la working con data division
      *          Tiene environment Y DATA DIVISION
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDP00003.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
            DISPLAY "Hola mundo vacio".
