      ******************************************************************
      * Author: Javier Gonzalez
      * Date:
      * Purpose: Insercion de la working con data division
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDP00001.
       PROCEDURE DIVISION.
            DISPLAY "Hola mundo vacio".
