      ******************************************************************
      * Author: Javier Gonzalez
      * Date:
      * Purpose: Insercion de la working con data division
      *          Tiene environment
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDP00002.
       ENVIRONMENT DIVISION.
       PROCEDURE DIVISION.
            DISPLAY "Hola mundo vacio".
