      ******************************************************************
      * Author: Javier Gonzalez
      * Date:
      * Purpose: Insercion de la working con data division
      *          Tiene WORKING Y VARIABLES
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDP00005.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VARIABLE PIC X(01) VALUE SPACES.
       PROCEDURE DIVISION.
            DISPLAY "Hola mundo vacio".
