      ******************************************************************
      * Author: Javier Gonzalez
      * Date:
      * Purpose: Verificar la insercion de codigo en EOF
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDP00100.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
            DISPLAY "Hola mundo sin parrafo ni stop run".
