      ******************************************************************
      * Author: Javier Gonzalez
      * Date:
      * Purpose: Verificar la insercion de codigo fin de parrado
      *          y de fin de modulo
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDP00102.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "Hola mundo sin parrafo ni stop run".
           STOP RUN.
