      ******************************************************************
      * Author: Javier Gonzalez
      * Date:
      * Purpose: Insercion de la working con data division
      *          Tiene WORKING
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDP00004.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
            DISPLAY "Hola mundo vacio".
