      * SDP DESCRIPTION
      *  Incluye COPY de codigo
      * SDP END

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDP99001.


       PROCEDURE DIVISION.
       INICIO.
           COPY SDPCNADA.
