      ******************************************************************
      * Author:  Javier Gonzalez
      * Date:    14/03/2015
      * Purpose:
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDPD0002.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 SDPD0003 PIC X(08) VALUE "SDPD0003".
       PROCEDURE DIVISION.
       INICIO.
            CALL SDPD0003.
            CALL SDPD0003.
            CALL SDPD0003.
            STOP RUN.
