      ******************************************************************
      * Author:  Javier Gonzalez
      * Date:    14/03/2015
      * Purpose:
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDPD0001.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       INICIO.
            DISPLAY "Hello world"
            STOP RUN.
